{"pages":[{"title":"Yeelight and Hyperion basic API and front-end","text":"Over the last week I've been looking into creating a basic web-service to easily interact with my lights around my flat. Currently, I have two Yeelights and a LightPack, which is located on the back of my TV. Stuff tied into this Raspberry Pi 1 Model B Tasker AutoVoice Hyperion Lightpack 1 Yeelights (~$20 USD) python-yeelight Cool things it can do RIGHT NOW Turn lights on when my phone connects to WiFi Notifications lights from my phone, passed on by Tasker IFTTT events Voice activated lighting cues, eg OK GOOGLE DIM LIGHTS , turn off, shut up etc using AutoVoice with Tasker Basic web dashboard to fire off effects to devices Using intents from (Sleep As A Droid)[https://play.google.com/store/apps/details?id=com.urbandroid.sleep&hl=en], turn off my lights when it's time to go to bed ~~Let people on the internet mess around with my light globes; this is a good idea~~ Cool things I'm thinking about doing with it Automatically adjust globe brightness depending on sunrise and sunset Get GPS co-ordinates from here Then use this API to return the current sunrise/sunset http://sunrise-sunset.org/api So, Perth would be http://api.sunrise-sunset.org/json?lat=-31.953&lng=115,8575&date=today (Adjust for GMT obvs) Audio queues and text to speech from the Raspberry Pi The CODE I'm running a SimpleHTTP server in Python to handle all GET requests. The requests check to see, firstly, if the device exists and if so, what effect to run on it. As an example: http://localhost:5000/device/effect. I thought this would make it easy to simply craft a HTTP GET rather than posting JSON to it. Also means I can use Tasker without having to use the Send/Except plugin, which is fine and also great, but takes a bit to setup. Not that I'm lazy or anything. It also means I can use IFTTT's Maker to easily hit the AIR QUOTES API AIR QUOTES You can view my source on github . It was written over a few days and strongly requires a re-factor. Setting up Tasker This can be a repetative process, but you can also copy the tasks you edit. AutoVoice is completely optional of course, and only if you're a giant nerd and want to tell OK Google to do stuff. Also excuse the ridiculously sized images. Creating a task is fairly simple. You just need to use HTTP Get to push commands off to the Python webapi While on the tasks tab... New Task Name => ~whateva~ Plus => Net => HTTP Get Enter the URL for the illuminate webserver and the device and effect, eg. http://10.1.1.69:5000/cool_light/good_effect So, my profile for my Snapchat notification is this: SnapeChatte in Tasker . To do this.. While on the profile tab... Press the plus button, then Add Event => UI Event => Notification Add Event UI Event Notification Owner Application => Select Snapechat, go back Enter Task Hyperion Yellow Hold down finger on the Hyperion Yellow task Add Task Yeelight K Yellow Blink Hold finger down on Notification Add State Net => Wifi Connected SSID => Enter your SSID for your WiFi Done! Breaking it down... Once we get a notification from the App Snapchat AND if we're connected to my local WiFi: Run task Hyperion Yellow, which will light my TV's backlights yellow Run task Yeelight K Yellow Blink, which will blink the kitchen Yeelight Adding a HTTP Get request | Editing the Task My \"OK Google Dim Lights\" profile is as follows: AutoVoice in Tasker Once we get the voice command 'Dim Lights' AND if we're connected to my local WiFi Run task Yeelight Dim The configuration for the above event looks like this: AutoVoice in Tasker Event Yeelights Yes, you can ping your light globes now; what a future we live in. It took me a while to workout how to enable the TCP JSON service on these lights. Turns out you need to download the Developer Mode application, then enable developer mode on each light globe. Xiaomi have also included a very comprehensive API documentation . But I'm being super lazy and using the python-yeelight package because it does pretty much everything I want it to do. Overall It was a pretty fun project. I think I'll need to upgrade my Raspberry Pi if I'm going to be adding text-to-speech. It's already processing video through to Hyperion! Also, please don't DDoS my lightbulbs. Thank you kindly.","tags":"Code","url":"http://mattie.id.au/posts/2017-02-yeelight-hyperion-front-end.html"},{"title":"boblightd and SteamOS","text":"Having some spare time, I thought I would see if it is possible to setup boblightd with SteamOS. It looks like it's possible, with X11 at least. https://code.google.com/p/boblight/wiki/Compiling Firstly, I added the wheezy distro to apt sources. It doesn't look like the libraries that are required, so I'm going to have to add some apt repos http://steamcommunity.com/groups/steamuniverse/discussions/1/648816742742587380/ Also, openssh-server, because I'm lazy and don't want to do it via the keyboard. sudo apt-get install libx11-dev libgl1-mesa-dev libxrender-dev libxext-dev portaudio19-dev libavcodec-dev libavformat-dev libavdevice-dev I ommited libswscale-dev, as it appears another version is installed. Let's hope that it'll compile ok! It appears to be missing libusb too! apt-get install libusb-1.0.0-dev ffmpeg - because I think we want v4l support, for boblight but we need to install libswscale2 in order for it to compile --with-ffmpeg apt-get remove ffmpeg libav-tools libavfilter2 libavfilter4 libswscale2 xbmc xbmc-bin let's install XBMC again, because it's a nice to have apt-get install xbmc It's compling okay, let's build! oops, apt-get install libtool g++ (no g++ was found) Looks like boblight doesn't come with support for lightpack, so use this one https://github.com/timsat/boblight-lightpack let's try that again... that worked ./configure --with-ffmpeg You will have to open boblight-v4l.cpp and videogabber.cpp and add the unistd header to the code, for some reason this will cause errors when you try to compile boblight vim src / clients / boblight - v4l / boblight - v4l . cpp ( some where with the rest of the headers ) #include <unistd.h> vim src / clients / boblight - v4l / videograbber . cpp ( some where with the rest of the headers ) #include <unistd.h> ./configure --with-ffmpeg make clean && make sudo make install Hooray, we have a build. Now, we need to edit /etc/boblight.conf First, let's find the USB device desktop@steamos:/usr/src/boblight-read-only/arduino$ lsusb Bus 001 Device 003: ID 1d50:6022 OpenMoko, Inc. While we're playing with USB devices, we need to make the usb port readable by the steam user, so... idVendor 0x1d50 OpenMoko, Inc. idProduct 0x6022 sudo vim /etc/udev/rules.d/69-persistent-usb.rules and add ATTRS{idVendor}==\"1d50\",ATTRS{idProduct}==\"6022\",MODE=\"0666\",GROUP=\"video\" Here is my version of boblight.conf that I pulled from my XBMC media centre sudo vim /etc/boblight.conf [global] interface 127.0.0.1 port 19333 [device] name ambilight channels 30 type lightpack output /dev/usb/hiddev0 interval 20000 debug on #bus 1 #address 6 #debug true [color] name red rgb FF0000 [color] name green rgb 00FF00 [color] name blue rgb 0000FF [light] name 1 color red ambilight 28 color green ambilight 29 color blue ambilight 30 hscan 0 16.67 vscan 75 100 [light] name 2 color red ambilight 19 color green ambilight 20 color blue ambilight 21 hscan 0 16.67 vscan 50 75 [light] name 3 color red ambilight 16 color green ambilight 17 color blue ambilight 18 hscan 0 16.67 vscan 25 50 [light] name 4 color red ambilight 22 color green ambilight 23 color blue ambilight 24 hscan 0 16.67 vscan 0 25 [light] name 5 color red ambilight 25 color green ambilight 26 color blue ambilight 27 hscan 0 16.67 vscan 0 16.67 [light] name 6 color red ambilight 1 color green ambilight 2 color blue ambilight 3 hscan 50 66.67 vscan 0 16.67 [light] name 7 color red ambilight 10 color green ambilight 11 color blue ambilight 12 hscan 66.67 83.33 vscan 0 16.67 [light] name 8 color red ambilight 7 color green ambilight 8 color blue ambilight 9 hscan 83.33 100 vscan 0 16.67 [light] name 9 color red ambilight 13 color green ambilight 14 color blue ambilight 15 hscan 83.33 100 vscan 0 25 [light] name 10 color red ambilight 4 color green ambilight 5 color blue ambilight 6 hscan 0 0 vscan 0 0 We now need the daemon and the client to launch when lightvm loads sudo vim /etc/X11/Xsession.d/91boblight #!/bin/bash export DISPLAY = :0 boblightd -f sleep 2 boblight-X11 -x -i 0 .03 -o value = 5 .0 -o saturation = 2 .0 -o speed = 60 .0 & And we need to add it to Xsession.options sudo vim /etc/X11/Xsession.options boblight Reboot, and you should have a working ambilight. I've found it to be completely slow and unuseable, but it was an experience. These things FAILED Now I tried doing this, but I could never get it to work. Appears SteamOS doesn't run through SysV? I don't know. I spent hours on this. Create a startup script in /etc/init.d vim /etc/init.d/boblightd.sh #!/bin/sh ### BEGIN INIT INFO # Provides: boblightd # Required-Start: $all # Required-Stop: # Should-Start: # Default-Start: 2 3 4 5 # Default-Stop: 0 1 6 # Short-Description: Starts boblightd ### END INIT INFO # OK GO prog = \"BoblightD\" case \" $1 \" in start ) boblightd -f > /dev/null 2 > & 1 echo \"Starting boblightd...\" ;; stop ) # No-op sudo -S killall boblightd echo \"Stopping boblightd...\" ;; * ) echo \"Usage: boblightd.sh [start|stop]\" > & 2 exit 3 ;; esac : Needs to run BEFORE lightdm desktop@steamos:~$ sudo update-rc.d boblightd.sh defaults","tags":"Gaming","url":"http://mattie.id.au/posts/2014-11-boblightd-and-steamos.html"},{"title":"Setting up SteamOS","text":"On Tuesday, I took the plunge and setup SteamOS beta on my HTPC - dual booting into Windows I had to use the ISO, as my mainboard doesn't appear to support UEFI. It is a faily old beast. Processor : Intel Duo Memory : xGB Hard Drive : 40 GB space allocated Video Card : AMD RADEON Joystick : XBOX 360 controller Although, my main goal was to Steam Stream games from my desktop, which has way more power behind it. The installation did run smoothly, nice hints of debian. I did have to run an expert install so I could dual boot. I was running Ubuntu on the drive, but I had to make sure it reformatted the partition I did run into a few problems, after installation though, which is understandable since SteamOS is -in beta-. Black screen after installation It looks like the Radeon card doesn't work straight out of \"the box\" I had to follow these steps in order to get the video card working, from Reddit Working suggestions for black screen after After getting that all sorted, the next problem I ran into Network problems I had some interesting networking problems. My RealTech network card was not installed by default. I had to insmod the device, then manually setup the network card. It began to install Steam, and in the Steam installation, the network card lost connectivity, for some odd reason, I had to fix it in the network manager conf file, and set it to managed. From AskUbuntu sudo nano /etc/NetworkManager/NetworkManager.conf and set managed to true Steam began to continue the installation after that. In-house streaming world problems I had a problem with In-house streaming. It appears that having VirtualBox installed messes with the network metric[4] Workaround - 1. Open up Network and Sharing Center 2. Click ‘Change Adapter Settings' 3. Right click ‘VirtualBox Host-Only Network', go to Properties 4. Double click \"Internet Protocol Version 4 (TCP/IPv4)‘under 'This connection uses the following items'. 5. In the Properties page, click\"Advanced…\" 6. In the \"Advanced TCP/IP Settings\", tab \"IP Settings\", uncheck the box marked \"Automatic Metic\" and type in 800 or higher. OK all dialogs and run whatever software could not Recieve multicast. The problem stems from Microsoft assigning interface Metrics based on the driver's own reported Link speed in Windows 7. Since that's all 1GB, there is a clash on metric. From VirtualBox tickets Installing XBMC I didn't bother installing XBMC, because it doesn't support hardware rendering on my Radeon, but it should work fine if you have a nVidia based video card. Setting up XBMC","tags":"Gaming","url":"http://mattie.id.au/posts/2014-10-setting-up-steamos.html"},{"title":"New blog - using Pelican","text":"So I've decided to finally get rid of Wordpress. Way too much bloat for what I need. I've made the switch to Pelican.","tags":"Code","url":"http://mattie.id.au/posts/2014-10-new-blog-pelican-other.html"},{"title":"Fix my brains","text":"On Thursday I decided to reach out to my GP and talk to him about my mental health. For the last year and a bit I've felt a lot more secluded, quiet and less social. Although, I've always been quiet in social situations, I have felt this more so in the last few months. Over the last couple of weeks I've chatted to some of my gaming buddies about the situation I feel like I'm in. One of the guys, whom I've known for a very long time posted about his condition and how EMDR therapy helped him quite significantly, along with talking to a psychologist and that he is doing a lot better than he has been before. His story gave me a more faith in 'seeing someone about my problems'. Also, over the last couple of weeks I've had my bestie come over from Melbourne and we talked about mental health, as she's studying to be a nurse, I made a promise to make sure I ended up seeing someone to get the ball rolling. I've always felt a bit 'out of it' when I'm around people. Recently I've just frozen up during conversations, not sure how to continue, my mind literally goes blank. This has started happening a lot more, even when talking to people I know very well and enjoy their company. I guess that's what triggered me seeking more information. I haven't always been so quiet, it's almost like I'm not myself. I'm not even making hilarious puns as often anymore, I'm like a piece of flint that's lost it's.. spark. Anyway, back to the GP, talked to him, a quick checklist of things could indicate a social phobia, which most my symptoms contain. He gave me 3 suggested ways of going about the treatment. Group therapy, CBT or medication. Also he gave me a test to do once I got home. So, right now I'm looking into treatments and seeing what would benefit me the most. Leaning more towards CBT. I'd rather fix my way of thinking then take a gunshot approach. I'll continue to post my progress here.","tags":"Personal","url":"http://mattie.id.au/posts/2014-02-fix-my-brains.html"},{"title":"2014","text":"Hello 2014, As people know, I'm not too keen on new year resolutions, so I've decided on a few things I would like to do this year. Learn Russian as a language - I've always been interested in what those crazy glyphs mean, as well as most the population know more than one language, I'd like to learn something new. Also, I like the way it sounds. Make a song - There's an Oxygen 49 that's been gathering dust that I really should put to good use. It's just sitting there, collecting dust, looking fancy with all it's numerous knobs and sliders and doing fuck all. I need to learn piano first, so that's also on the cards. I have Synthesia and it's learning pack that will give me some ground. Start dating again - It's been over 2 years since I've had a girlfriend. It's been a long time and I'm kinda shy about the idea. I would just like to spend time with someone and do fun things with. Also fun dumb things. It also gets harder to date as you get older. Write Some Blog Posts - I pay for this domain and hosting, although I don't really put it to good use. Let's change that. People like my posting, right? Hopefully I can post something once a week. Hooray. Get out more - I've spent way too much time watching TV in the last year and staying home, hermitising (hermitosis?). It's too comfortable to me now and it has to change. I may even start running and roller derby training again (Although I desperately need new skates to do that). I may even take up Lazer Blaze! I think that wraps it up. I just need to plan and make some short term goals, weekly goals. They seem more achievable short term, but hopefully will run into long term. Wish me luck. Actually, don't. I can do this.","tags":"Personal","url":"http://mattie.id.au/posts/2014-01-2014.html"},{"title":"Playing around with Net::Twitter in PERL","text":"Here are some perl recipes that I've written that helps interface with Twitter and run some basic tasks. You will need to create a Twitter application, generate a consumer key and twitter tokens (with read/write access). This first piece of code needs to be on all the scripts below. It sets up the Net::Twitter object and authenticates. #!/usr/bin/perl use Net::Twitter ; use Net::Twitter::Core ; use Scalar::Util 'blessed' ; use List::Util ; my $nt = Net::Twitter -> new ( legacy => 0 ); my $ntc = Net::Twitter::Core -> new (); #\\_with\\_traits(traits => [qw/API::Search/]); my $consumer \\ _key = \"CONSUMER KEY\" ; my $consumer \\ _secret = \"CONSUMER SECRET\" ; my $token = \"TWITTER TOKEN\" ; my $token \\ _secret = \"TWITTER TOKEN SECRET\" ; my $nt = Net::Twitter -> new ( traits => [ qw/OAuth API::REST API::Search/ ], consumer \\ _key => $consumer \\ _key , consumer \\ _secret => $consumer \\ _secret , access \\ _token => $token , access \\ _token \\ _secret => $token \\ _secret , ); The first one, will unfollow Twitter users that do not follow you back. Keep in mind that you have a limit of 350 API calls an hour, in able to do these actions. The script has been adjusted to end when it reaches less than 50 calls left. my $user = $nt -> show \\ _user ({ screen \\ _name => 'YOUR USERNAME' }); my $uid = $user -> { 'id' }; my $r = $nt -> friends \\ _ids ( $uid ); my $apicalls ; # Do this, so we don't always get the same IDs, mix it up a bit. my @friends = ( sort { int ( rand ( 3 )) - 1 } @ { $r -> { ids }}); foreach my $id ( @friends ) { my $fs = $nt -> follows ( $id , $uid ); if ( $fs ) { print \"[\\*] \" . $id ; } else { print \"[!] \" . $id ; $nt -> unfollow ( $id ); } $apicalls = $nt -> rate \\ _limit \\ _status (); print \" [API:\" . $apicalls -> { 'remaining\\_hits' } . \"]\\\\n\" ; if ( $apicalls -> { 'remaining\\_hits' } < 50 ) { last ; } } print \"Remember, you can only run this every hour. $apicalls-> {'remaining\\_hits'} API calls left.\\\\n\" ; The following piece of code keeps a hash of people who are currently following you and checks if they still are following you. If they're not, it will send a notification to my phone that a person has unfollowed me. I'm using NotifyMyAndroid for notifications. I have a cronjob that runs this script every hour. my $f ; my $follower \\ _file = './followers.hash' ; my $unfollow \\ _file = './unfollow.hash' ; if ( - e $follower \\ _file ) { $f = retrieve ( $follower \\ _file ); } my @ids ; for ( my $cursor = - 1 , my $r ; $cursor ; $cursor = $r -> { next \\ _cursor } ) { $r = $nt -> followers \\ _ids ({ screen \\ _name => 'YOUR TWITTER USERNAME' , cursor => $cursor }); push @ids , @ { $r -> { ids }}; } my $flw = 0 ; my $cnt = 0 ; my $uinfo ; my $unfollowers ; foreach $fid ( @ { $f }) { foreach $tid ( @ids ) { if ( $tid eq $fid ) { $flw = $tid ; next ; } } if ( ! $flw ) { try { $uinfo = $nt -> show \\ _user ( $fid ); if ( $uinfo ) { if ( ! $nt -> friendship \\ _exists ({ screen \\ _name \\ _a => $uinfo -> { 'screen\\_name' }, screen \\ _name \\ _b => 'YOUR TWITTER USERNAME' })) { $unfollowers -> { $fid } = $uinfo ; print \"U: \" . $uinfo -> { 'screen\\_name' } . \" ($fid)\\\\n\" ; nma \\ _notify ( $uinfo ); $cnt ++ ; } else { print \"F: \" . $uinfo -> { 'screen\\_name' } . \" ($fid)\\\\n\" ; } } else { print \"X: Error?\" ; } } catch { print \"$fid has been deleted.\\\\n\" ; $unfollowers -> { $fid } = $fid ; } } store \\\\ @ids , $follower \\ _file ; if ( $cnt ) { print \"- Found $cnt unfollowers.\\\\n\" ; store $unfollowers , $unfollow \\ _file ; } else { #print \"- No unfollows\\\\n\"; } sub nma \\_notify { my $user = shift ; my $userAgent = LWP::UserAgent -> new ; $userAgent -> agent ( \"NMAScript/1.0\" ); $userAgent -> env \\ _proxy (); my $requestURL = sprintf ( \"https://nma.usk.bz/publicapi/notify?apikey=%s&application=%s&event=%s&description=%s&priority=%d\" , \"NMA API KEY\" , \"Twitter\" , \"Unfollowed on YOUR USERNAME by \" . $user -> { 'screen\\_name' }, \"You were unfollowed by \" . $user -> { 'name' } . \" \\\\nTheir last status: \" . $user -> { 'status' } -> { 'text' }, - 1 ); my $request = HTTP::Request -> new ( GET => $requestURL ); my $response = $userAgent -> request ( $request ); return $response ; } There's a thing on Twitter called \"FOLLOWBACK\" or \"TEAMFOLLOWBACK\", where Twitter users follow back when you follow them. They don't always follow back so there is a bit of risk involved, if you are inclined to grow your follower count (it matters for some people, I guess?) my $count ; do { my $sleep = 120 + rand ( 120 ); my $search \\ _term = \"TEAMFOLLOWBACK OR FOLLOWBACK\" ; my $r = $nt -> search ( $search \\ _term ); for my $status ( @ { $r -> { results }} ) { my $tweeter = $status -> { from \\ _user }; # Don't bother if we're already following them if ( ! $nt -> friendship \\ _exists ( 'YOUR TWITTER NAME' , $tweeter )) { my $cf = $nt -> create \\ _friend ( $tweeter ); $count ++ ; print \"+ \" . $tweeter . \"\\\\n\" ; } } print \"Added $count ...sleeping\\\\n\" ; sleep ( $sleep ); } while ( 1 == 1 );","tags":"Code","url":"http://mattie.id.au/posts/2012-07-playing-around-with-nettwitter-in-perl.html"},{"title":"Automate my everythings","text":"I spent some of the day, between tasks, to take a look at \"if this then that\" or otherwise known as ifttt . ifttt allows you to essentially script events to actions. For example, I wrote a recipe that emails me when Gizmodo's App Deals gets posted, then tells me what mobile applications are on sale for the day via email. I got a bit excited and went through some of the recipes that were on display and ended up with some tasks that archived all my tweets into evernote and my favorites. I'm sure I'll go over it tonight to see what else I can do with it that would be relevant to my interests. There's also zapier.com (Thanks Jordan S) which can also do the same thing, but with different \"channels/apps\" most noted, GitHub and JIRA! For mobile users, there's on{x} , where you can script events on your phone to do certain things. Best bit is that it's written in JavaScript – so you can do quite a bit with it. I haven't played around with it yet, but I'm sure I will in the near future.","tags":"Systems","url":"http://mattie.id.au/posts/2012-06-automate-my-everythings.html"},{"title":"RITRU: Rad internet tools round up","text":"Here's this weeks round up! 30 of the best vector and illustrations, free – More free vector art for the masses! Pachelbel Rant – I knew Basketcase by Greenday sounded familiar. On{x} – JavaScript script your Android device. SCVNGR -Secret Game Mechanics Playbook. Interesting look into how Zynga develops their games and other developers.","tags":"Links","url":"http://mattie.id.au/posts/2012-06-ritru-rad-internet-tools-round-up-2.html"},{"title":"RITRU: Rad internet tools round up","text":"MORE COOL STUFF ON THE INTERNET 15 Rad Robot Accessories – Kick ass robot desktoys and the like. (Via @Kasey_ L/@Mashable ) This Is Why I Am Broke – Pretty much. ifttt – Put the internet to work for you. Bulk Rename Utility – A pretty good bulk renaming utility, if you excuse the terrible clutter. Cookoo Watch – Watch for geeks who want to keep it subtle. Whiskey Media – An API for Comics and Games. Procatinator – CATS AND MUSIC! 20 Examples of Stereographics that Grab the Attention Iconspedia -A collection of free icons. navigator.connection – Optimizing based on connection speed: using navigator.connection on Android 2.2+ (Via @m4rkmc) Automated Testing of ASP.NET MVC Applications – Via @uluhonolulu","tags":"Links","url":"http://mattie.id.au/posts/2012-05-ritru-rad-internet-tools-round-up.html"},{"title":"RITRU: Rad internet tools round up","text":"Here's a few things I've found useful on the internet this week; Audio Tool – Create music with your web browser. Javascript Piano – A piano written in JavaScript. (via @ZenPsycho) Leaflet - Create JavaScript maps similar to Google Maps – without having to worry about purchasing a license. Data Visualisation Tools – A collection of web based tools you can put together some awesome data visualisations. Stamen – Water colour style maps using OpenStreetMap . OpenSignalMaps – Find the best mobile network in your area. Alltop Infographics – A collection of links related to infographics. Easel.ly - Create infographics online easily. Venngage - Create custom infographics online, engage your views and track your results. Infogram - Create interactive infographics. SchemaVerse - The Schemaverse is a space-based strategy game implemented entirely within a PostgreSQL database. HADOOP – Open source, scalable, distributed computing. Mechanical Turk - Amazon's Mechanical Turk, crowd sourcing. Microworkers – Crowd sourcing little things, such as tweets, facebook likes and other marketing related things. 15 Useful Web Apps for Designers - A bunch of cool web apps for designers or designer at mind. 40 High Quality Free XHTML/CSS Web Template for Developers - Some free high quality templates. 101 Apps for Your Web App Startup Toolbox – Just as the title suggests, there's quite a few of them. Free Vectors - A whole bunch of free to use vectors presented in thumbnails. Handwriting Fonts – Hand writing fonts for kids to trace over.","tags":"Links","url":"http://mattie.id.au/posts/2012-05-ritr.html"},{"title":"Commodore 64 ringtones and notifications for Android","text":"Last night I compiled a list of tones I would like to use on my phone. Most of them are based from classic Commodore 64 games. I spent about 4 hours converting SID to WAV, then to MP3 to save space on my phone. Just thought I would share. The download link is ad sponsored by adf.ly , I did this so I could recieve some credit for my 4 hours work. So deal with it. It's also about 60MB. So, enjoy! 60MB of Commodore 64 ringtones and notification tones","tags":"Music","url":"http://mattie.id.au/posts/2012-02-commodore-64-ringtones-and-notifications-for-android.html"},{"title":"Compiled Pidgin SIPE plugin for Win32","text":"Update: You can now get builds off sourceforge . If you want to know how I built it… Since we use OCS at work quite a bit, and recently we've updated to Group Chat - I've manged to compile libsipe.dll using the latest trunk. I'll update it when there are updates to the project since I have it all running nicely on my Ubuntu box![STRIKEOUT:I'm not sure how to get Group Chat up and running as of yet, maybe someone could help me? I don't know what URI to put in. But at least the dialog is there in this plugin version.] Managed to sort that one out :) - was entering the wrong group chat server URL. I've setup autobuilding for every week, you can check out the DLLs here \\<nope, lost everything in a server crash> If you come across any problems please let me know so I can investigate :) Enjoy! Some notes on how I built this Firstly, you need to build Pidgin. I followed this guide . But specifically, this is what I did : I built everything under /usr/src/pidgin Installed the following packages via apt-get ( sudo apt-get install mingw32 mingw32-binutils mingw32-runtime ) Followed Step 2 in the guide linked to the URL above Installed Pidgin's build dependencies as per the guide Followed the cross-compiling guide Built pidgin using the mingw make file (using the Build Pidgin instructions from the above guide) Once it built cleanly, I grabbed the latest source for libsipe via git Followed only the 1st step from the libsipe website, just to get the code Grabbed the dependencies specified in this wiki article I then had to edit the Makefile.mingw (and other occurrences of the file) to meet the pidgin version I was compiling against Tried to compile it, it came back with a whole bunch of errors and I manually went through all the error'ing related files (from memory, usually a bunch of header files) and made sure they were set Handy links OCSPedia - Shows how to generate a group chat log file, pretty useful if you want to check out what your URI is Update: If you want to grab the latest release (1.12) you can get it from here (dropbox)","tags":"Code","url":"http://mattie.id.au/posts/2011-04-compiled-pidgin-sipe-plugin-for-win32.html"},{"title":"Maybe a bit more about my inner geek","text":"So I'm guessing a few of you already have seen my entry to iiNet's TopGeek competition . There's a bit more it to the brief bio I put on the website. I guess it all started when I was young, around the age of four, my parents were given a Commodore 64 by my Uncle - it came with a Tape deck and a cartridge game called Tooth Invaders . Interesting game, you were given a set of teeth to look after and you had to fight germs off the teeth with a toothbrush. Occasionally flossing between the teeth and you had to avoid a little green dude who would kick your ass if he touched you. A couple of years passed and there were a couple of people at school who also had a Commodore 64, we would borrow games and play them. My Dad came back from Canada after visiting his father with a box full with games, one that I got really addicted to was Maniac Mansion . Would have to say one of my most favorite games in the entire fucking world. You could choose 2 out of 6 players (you get stuck with Dave, the most useless guy ever) each of the alternative 6 players had different skills and abilities, which also meant you could complete the game in many different ways. This formed my love for click adventure games. Along with Maniac Mansion, was Labyrinth - I guess a pre-scumm game, but it was very interactive and fun, also based on the movie. I guess this is where my love for gaming came from. Also playing Granny's Garden on the BBC's in primary school. That game scared the hell outta me, maybe it was her big pixel nose that bothered me. I don't really remember. Later in life, I got access to a PC, 486 I think from memory. After school I used to create games in ZZT. As well as rollerskating. That was all the rage back then. Pretty sure I made a ZZT game about Rolloways. But anyway, I became more interested in other aspects of computing, such as hacking. I remember sitting in the computer labs at school, we only had 486s - oh man we played STUNTS on them while the teachers were out, it was the fucking bomb! Pretty sure I managed to install a virus on one of the machines, Ping-pong and the teacher freaked out. Our school wasn't exactly computer literate. I remember when we first got the internet at home. It was a dial-up shell account on Multiline. First browser I ever used? Lynx. When I was 14, I remember printing out pages and pages of things to read, actually from the Triple J website (lets see if we can use the wayback machine on it.. oh yeah.. not that far though. All my friends were confused and didn't quite understand the use for it, I loved it! Later, in year 11 I discovered something called IRC.. ended up getting a bit too addicted to that and spent most my time online chatting to people, writing scripts in mIRC and making new friends on AU's Undernet server.. which ended up splitting off to oz.org because of so many netsplits. I lurked in channel #Perth and #Perth-16-20 (lol) most. Too much time online ended my studies at high school pretty early in year 11. I started hanging around with an older crowd, students at UWA and some other people. This is where I got introduced into lasertag, by a guy called RoaDKiLL. Every Monday night we would rock up to Zone 3 Northbridge for a weekly competition. Back then they were using the old V4 model P&C packs, which, are still the greatest zone packs on earth. Why? THE TIMING IS SO DAMN PRECISE (the newer infusion packs, the ones they have now at Darkzone, are not as responsive - because of the radio that enables the live scoring, it needs to talk back and forth to the server). I became slack during this time, not doing much with my life. I was being very social online and not so much outside, except for the occasional rollerskating on Friday nights. Yes - I love skating, as you might have already guessed. The rush of skating fast and dodging people is amazing. Back then I remember playing mutiplayer Heretic with one of my UWA mates, over a 9600bps modem, it was fantastic. Also back then I was getting into the Lucasarts click adventure games, Monkey Island - my most favorite game in the universe. As I wasn't doing much, my step mum got on my case, ended up getting me an apprenticeship at the company which she had recently purchased, Comfix. Back then there were no real IT courses so the apprenticeship I had to do was called Electronic Servicing. At Comfix I was repairing Commodore 64s, Commodore Amigas, Lynx Gamegears, PCs and other really old machines. I learnt so much from that place, which inspired my love for gadgets :~) Later on, I found myself out of work then decided to look more into programming. Found myself working on a business application written in Win32-C. Yet was later replaced with a perl script. I begin hanging out with a couple of my mates, one of them was doing studying computer science at Murdoch -- another just chilling out. We used to play Starcraft every night, for weeks on end. I felt like I was doing nothing, I thought I might head back to what I know, IT support and to attend university at the same time. Later, one of my mates asked me if I was interested in working in a web development role. I enthusiastically said OH HELL YEAH and went to work for them. That's when I was first introduced into PHP and ASP programming. I became more and more interested in what I could do with web related services and databases. This was maybe one of my major turning points down to what I am currently doing today, working as a Programmer at a local ISP. Gaming wise, I've just started to get into Lord of the Rings Online. It's free so I thought I might give it a chance, so far it's okay – I'm playing it with my fiancée, who is the most awesome and beautiful person in the entire whole world – but I'll post more about her later ;\\~). Infact we recently just moved out together. I used play World of Warcraft quite a bit. I had a Warlock, Paladin, Druid and some other characters all up to 80. Once I hit 80 I wasn't quite sure what to do, because I simply can't stand raiding. It's boring, repetitive and a major timesink. I did, however, enjoy world PVP, griefing is fun! – So I learnt from playing hours and hours of EVE Online with a certain corporation called GoonFleet. Industrial espionage in a MMORPG? oh hell yeah. We had a spymaster, here is an article on his work in the game. I was one of the guys that stepped up and snuck an alt player into one of our rival corporations, Lokta Veritas. It was bit of a fun experience, trying to act undercover. I setup a PHP script on my server at home that posted everything that happened into LV's corporation/gang chat window, so the spymaster could process the information and relay it on to the people who needed the information. GoonFleet was a lot of fun, just being a general jerk in EVE Online surrounded by others who took it so so seriously. I enjoy making my life easier around the house, and smashing up scripts in PERL, BASH and PHP. I wouldn't go to the extent of creating an IP controlled toaster, but I would go to the effort of setting up a TV box with XBMC - with notifications being pushed to it. Or gathering usage from various items around the house. I love data. DATA DATA DATA DATA, but not the Brent Spiner kinda data. He was always an awkward android. I'm pretty big into scifi's and that kinda pop-culture thing. I watched the entire Next Generation series while sitting at my desk at my old job, while smashing out code for the website we were working on. My favorite store would have to be Minotaur in Melbourne. That place is god damn amazing. I have a secret love for typography. mmmMmm typography. hell-vetica-yeah. Not to mention, I'm also a bit of a music geek. If I've heard the band before I can usually guess who they are, not to mention being able to spot known tunes within at least 15 second of the song actually playing. I love music. Puns? I love puns. Puns are amazing. I'm looking at doing some development work on the HTC Desire HD - android based phone. I have a few ideas and I'm going to see what I can come up with. Of course I'll post what I make on my blog. (This thing, right here, you're on it now) So far I've posted on Twitter and Facebook, asking my mates to share my iiNet's TopGeek vote url. As of yesterday I launched a banner campaign on SomethingAwful as well as linking my URL on Delicious and Reddit. Vote for me please, I really want to beat Simon Hackett.","tags":"Personal","url":"http://mattie.id.au/posts/2010-12-maybe-a-bit-more-about-my-inner-geek.html"},{"title":"I got my wheels back","text":"[flickr pid=\"4621403349\" size=\"medium\"] Tonight I decided to hit the Rollerdrome for my now usual fortnightly skate. I sat down tied my skates up then hit the rink. The first thing I do when I get on the rink is to check the grip and holy shit – my wheels did not stick to the ground. This is quite awesome because it meant one thing. The last times I've been skating I haven't been able to powerslide properly; powersliding is where you put all your weight on your wheels going the opposite side to where you were skating, it also makes loud noises and sometimes sparks (if you're lucky). This was so great. It meant that I had pretty much the best control I could have. Reminded me of back when I used to skate at Rolloways as a teenager being able to do freaky skate shit, like diving in between clumps of people who are slowly skating around. Catching that half a second window you get between people and sneaking up to someone and letting a massive sounding powerslide go. I've been skating for a pretty long time, ever since I was 13. I took it up because I really slow at running and I needed something to do in my spare time; skating seemed pretty good. Started with the learn to skate program, did all the star classes and ended up pretty decent at skating. (I will not mention that it was a figure skating class either… then again I was one of the few people that figure skated in speed skates) It's just so exciting feeling the air rush through you, knowing you are in complete control and you can recover from any slight slip-up with mad balance control. [flickr pid=\"4611494482\" size=\"medium\"] I've been going road skating a fair bit. My recent and longest skate going at a constant speed (mostly because there was NO ONE at all on the foot/bike paths) was the following RunKeeper entry: http://rnkpr.com/a5rhfd . Of course, this skate might of effected my wheels as I was using rinky wheels instead of road wheels. My axels are fucked okay. Looking forward to some more skating. Considering being a referee for the upcoming roller derby games. I think learning a massive rulebook to see girls beat and trip each other up would be well worth it. ;) And that, is how I roll.","tags":"Skating","url":"http://mattie.id.au/posts/2010-05-i-got-my-wheels-back.html"},{"title":"Zone Warriors updates","text":"As a few of you already know, I've been slowly working on a secret zone stats projects. It'll be hosted on zone-girls.com until I can afford a new domain name and hosting. The data will be collected by Torn XML files and it will also be manually entered if data is pre-Torn. You will be able to select a tournament, or a competition. The interface will show a table of the teams (leader board style) where the user can click on a team for a certain to break down into the team's scores over the season, bested colour as well as other stats. Then it'll have links to the players on the team then bring up stats for that player, in that certain tournament. It will also link to the players \"global\" profile, listing their achievements, teams and competitions participated in. Highest rank in x. MVP count. Number of trophies. That kinda junk. The post production name is not set in stone, so I'm using Zone Warriors as the name. There will be pretty graphs, no doubt about that. Also an achievement system where I am happy for suggestions. Leave a comment here or a message on the Darkzone WA forums . In no particular order -> Parse Torn files generated by Doug's Torn software (21/02/10) Parse different formats and/or support for manual data (for comps pre-torn) Usable admin / interface Add a site (21/02/10) Add a tournament (21/02/10) Queries! Team ladder Solo ladder Team tournament profile (21/02/10) Player tournament profile Player overall profile Site review and related media (a profile for the site!) Button hookups (ID to Profile) Graphs (Via JPGraph and/or XML/SMF Charts ) NO USE THIS!! Google Vis Achievement system (would appreciate ideas) Commenting ability Hook up with the SMF authentication to use as a primary source of authentication for the website Make the whole webpage look pretty Online fixtures Online fixture generator following Doug's 3-team grids Caching of finished events Events! Notification via email/IM and reminders. Ability to comment and rate past tournaments! RSS/iCal compliant Podcast support (lol) Who is currently at zone? via 4sq If you can think of anything else that I could put on it, please let me know!","tags":"Code","url":"http://mattie.id.au/posts/2010-02-zone-warriors-updates.html"},{"title":"Reactivated some EVE Online","text":"Yeah, thanks reaps for tweeting about the last couple of days, also CCP for sending me emails to activate my account 5 DAYS FREE $9.99 WOOOOO. Both of my accounts have been activated again.","tags":"Gaming","url":"http://mattie.id.au/posts/2010-01-reactivated-some-eve-online.html"},{"title":"So, we got World of Warcraft MMO gaming mice","text":"Sera decided to purchase a couple of these World of Warcraft MMO gaming mice for my birthday. They look pretty great, having 15 buttons, cool glowing OLED that pulsates. It takes a while to get used to the handling and the design since it's a bit different to normal, more ergonomic mice. But apart from that, so far, the hardware acts really well. The buttons are well placed and it's very good. One slight problem. The software that comes with is absolute crap. It's very poorly written. It can't even handle malformed XML and will just crash. Error handling? Jesus christ learn how to. I tried to simply import a profile via the armory and I get an AP MFC error. Why? because the image location has changed or something. How hard would of it been to, say if there was an error. 1) Display there was an error getting the image 2) Replace it with a stock image. Oh, the images? they're STOCK IMAGES AND DO NOT REALLY CHANGE. You could of distributed them with the package. The only problems I have had though, are to do with profile handling. The other options in the software are okay, such as setting up key bindings, macros and junk like that. I've recently bought my mouse into work and bound cut, paste, hide desktop, tab forward, tab backward, build, build project and it works pretty well.","tags":"Gaming","url":"http://mattie.id.au/posts/2009-10-so-we-got-world-of-warcraft-mmo-gaming-mice.html"},{"title":"100 Commodore 64 games in 10 minutes","text":"http://www.youtube.com/watch?v=eY2gK1MPgh8 Here is my guess list from the above video. 85/100. The list is a bit messy because I was frantically writing them down. xD The music is also pretty fucking awesome. Last Ninja 2 IK+ Maniac Mansion Pirates Zak McKraken and the Alien mind bender Vendetta Turrican 1 Arhcon Bubble Bobble Summer Games ??? Bruce Lee Last Ninja 1 ??? Turrican 2 ??? Defender of the Crown Asterix International Soccer bootcamp Kick Off Nick Faldof golf Hyper games Winter games Creatures 2 Impossible Mission Usagi ojuimbo gianna sisters ???? Californa games Boulder dash ??? Wizard of Wor ?? ?? Mayhem in MOnsterland Stunt racers H E R O Pitstop 2 Skate or Die Space Taxi Pub Games Batman Capered crusader Donald Ducks Playground Rainbow Islands Green BEret Tusker Shadow of the beast International Karate 2 Midnight Resistance Paradoid Gauntlet Salamander? Blue Max Duckular ??? ??? Wizball Dunebuggy Who dares win lode runner spy vs spy devilance circus games? jumpman zynaps kung fu master crystal castle? powerdrift rick dangerous pipe dreams 3? barbarian frankie goes to hollywood ghost n goblins lazy jones way of the exploding fist raid over bungling bay decathalon manic miner gremlins 2 nebulus ??? ??? spyhunter turbo outrun aztec quest goonies batty preditor(?) ghostbusters ??? forbiden forrest ??? ?? commando bc's quest for tyres ??? kickstart arkanoid 2? flumbo's quest","tags":"Gaming","url":"http://mattie.id.au/posts/2009-09-100-commodore-64-games-in-10-minutes-well-i-got-85100.html"},{"title":"Combined graph in ASP.NET with OWC","text":"It took me a while to find out how to get a hang of making graphs in ASP.NET combined with OWC. There aren't many places on the internet that show, or have a good guide. I was having troubles with creating a combined OWC graph in ASP.NET and I finally worked it out. I thought I would share. I've left some of the different methods and properties in there, mostly the styling ones to give a better idea on how to style your graph to suit you. The DataTable bit is in there also. If you want to test it straight out you can replace that with an array of your choosing. const int XAxis = 0 ; const int YAxis = 1 ; DataTable dt = this . DataSource ; ChAxis axis = null ; ChAxis axis2 = null ; ChSeries seriesValue = null ; ChSeries seriesMoreValue = null ; ChSeries seriesY2 = null ; ChartSpace = this . GetBaseChartSpace (); ChChart chart = ChartSpace . Charts [ 0 ]; #region Grab the data from the database and put it in a couple of arrays List < object > listValues = new List < object >(); List < object > listMoreValues = new List < object (); List < object > dateList = new List < object >(); List < object > listY2Values = new List < object >(); foreach ( DataRow row in dt . Rows ) { dateList . Add ( row [ \"Date\" ]); listValues . Add ( row [ \"Value1\" ]); listMoreValues . Add ( row [ \"Value2\" ]); listY2Values . Add ( row [ \"ValueY2\" ]); } object [] dateArray = dateList . ToArray (); object [] valueArray = listValues . ToArray (); object [] moreValueArray = listMoreValues . ToArray (); object [] y2Array = listY2Values . ToArray (); #endregion #region Series data seriesValue = chart . SeriesCollection . Add ( 0 ); seriesValue . Caption = \"Value Array\" ; seriesValue . SetData ( ChartDimensionsEnum . chDimCategories , Convert . ToInt32 ( ChartSpecialDataSourcesEnum . chDataLiteral ), dateArray ); seriesValue . SetData ( ChartDimensionsEnum . chDimValues , Convert . ToInt32 ( ChartSpecialDataSourcesEnum . chDataLiteral ), valueArray ); seriesValue . Interior . Color = \"#FF9E00\" ; seriesMoreValue = chart . SeriesCollection . Add ( 1 ); seriesMoreValue . Caption = \"More Value Array\" ; seriesMoreValue . SetData ( ChartDimensionsEnum . chDimValues , Convert . ToInt32 ( ChartSpecialDataSourcesEnum . chDataLiteral ), moreValueArray ); seriesMoreValue . Interior . Color = \"#F7D708\" ; #endregion #region Chart settings chart . Type = ChartChartTypeEnum . chChartTypeColumnClustered ; chart . Interior . Color = \"whitesmoke\" ; chart . PlotArea . Interior . Color = \"white\" ; chart . Title . Caption = \"The chart header\" ; chart . HasLegend = true ; chart . Legend . Position = ChartLegendPositionEnum . chLegendPositionBottom ; #endregion #region value axis (Y Axis) chart . Axes [ YAxis ]. Scaling . Minimum = 0 ; chart . Axes [ YAxis ]. HasTitle = true ; chart . Axes [ YAxis ]. Title . Caption = \"This is the Y-axis\" ; chart . Axes [ YAxis ]. HasMajorGridlines = true ; chart . Axes [ YAxis ]. HasMinorGridlines = true ; chart . Axes [ YAxis ]. MajorGridlines . Line . Color = \"lightgrey\" ; chart . Axes [ YAxis ]. MinorGridlines . Line . Color = \"#EEEEEE\" ; chart . Axes [ YAxis ]. HasTickLabels = true ; #endregion #region date axis (X Axis) chart . Axes [ XAxis ]. HasMajorGridlines = true ; chart . Axes [ XAxis ]. MajorGridlines . Line . Color = \"lightgrey\" ; chart . Axes [ XAxis ]. HasMinorGridlines = false ; chart . Axes [ XAxis ]. HasTitle = true ; chart . Axes [ XAxis ]. Title . Caption = \"Date\" ; #endregion #region value axis (Y2 Axis) seriesY2 = chart . SeriesCollection . Add ( 0 ); seriesY2 . Type = ChartChartTypeEnum . chChartTypeLine ; seriesY2 . SetData ( ChartDimensionsEnum . chDimValues , Convert . ToInt32 ( ChartSpecialDataSourcesEnum . chDataLiteral ), y2Array ); seriesY2 . Caption = \"This is the Y2-axis\" ; seriesY2 . Line . Color = \"#CE0000\" ; seriesY2 . Ungroup ( true ); axis2 = chart . Axes . Add ( seriesY2 . get \\ _Scalings ( ChartDimensionsEnum . chDimValues )); axis2 . Scaling . Minimum = 0 ; axis2 . HasMajorGridlines = false ; axis2 . Position = ChartAxisPositionEnum . chAxisPositionRight ; axis2 . HasTitle = true ; axis2 . Title . Caption = \"Y2 caption\" ; #endregion See https://gist.github.com/spyn/83aebdb9b8ffb8e6a682 Some related links: MSDN Office Web Components Constants http://msdn.microsoft.com/en-us/library/aa204179%28office.11%29.aspx There are probarly some other, better, controls out there.","tags":"Code","url":"http://mattie.id.au/posts/2009-09-combined-graph-in-asp-net-with-owc.html"},{"title":"Jocelyn's Horroscope","text":"Introduction This report is a short edition of the AstroText Youth. It is meant as a sample and advertisement for the full version of the AstroText Youth which can be ordered from Astrodienst as a downloadable E-Horoscope of about 20 - 30 pages. In the short edition, only a few, but nevertheless important aspects of your natal chart are considered. The report was generated with the following birth data: female, born on March 2007 in Perth, Australia. Your sun sign is Pisces. This is the sign in which the Sun is in your birth chart. Your Ascendant, the rising sign, is in Leo, and your Moon is in Sagittarius. Leo Rising You like to be the center of attention, to appear strong, confident and dominant, even if something is bothering you. You like to be the leader, and you can be a good one as long as you remember that leadership is a responsibility as well as power and privilege. You can be stubborn, especially if your pride is involved. You are idealistic, and people have to prove to you that they have integrity. You like to have rich and elegant things that you can show off to others. But remember that just because something impresses people, it is not necessarily good. You need to learn the difference. Others may or may not see you as beautiful or handsome, but as you grow up you will develop a regal bearing that will make others feel that you are dependable. Many people will like you, and most will also respect you. Sun in Pisces You are a very sensitive and emotional person who quickly picks up moods and emotions from other people and makes them part of your own. This trait makes it very easy for others to hurt your feelings. Because you have the ability to put yourself in someone else's place, you have an exceptional understanding of other people's needs. Whenever possible, you try to help others, because it makes you feel good about yourself. Very often you like to go into your own private fantasy world and think about ideas that mean something only to you. Just don't spend so much time there that you lose track of what is happening outside in the real world. You may be somewhat shy, because you feel you have to trust people before you can really open up to them. But even though you are shy, you do need other people, for without them you feel lonely, even in your own private world. Sun in the Seventh House You are at your best with another person, either working or just having a good time. You are able to adjust your own needs to someone else's so that together you make a pair that works better than either of you would separately. You are very social, and you have learned early in life to get along with others. For this reason, you are able to help others patch up an argument, because you see both sides of the controversy. Some people express another side of the seventh-house Sun. You may really feel like arguing and fighting with others, instead of trying to get along. Don't make a habit of it, because everyone gets tired of fighting eventually. You should learn to be more independent. Also avoid making compromises that require you to give up something essential just to keep a friend. Moon in Sagittarius You are an idealist who wants the world to be grand and good and beautiful. You want people to be good and noble and are very disappointed when they are not. You are so concerned with the important things in life that sometimes you forget about little matters that really have to be done. You are very independent and resent anyone who tries to keep you from doing what you want. You are optimistic and cheerful, and you can't stay sad for very long. Usually you feel good about life, and you try to make others around you feel that way also. People will like you for this. When you are an adult, you will be interested in any subject that teaches you more about the universe and your place in it. Moon in the Fourth House To be at your best, you need to have a peaceful home life, for this means emotional security to you. When you feel strong and secure, you are very kind and sensitive to other people's feelings. But if you feel depressed or insecure, you tend to withdraw into your own private world. Your mother is very important to you, and you need to be close to her. You are interested in the past, and you may become an eager student of history, especially the history of your own family origins and background. Venus in Aries You are very affectionate toward others, but you hate to be tied down by anyone. Not shy or reserved, you express your loving feelings freely, and you need to be free to love whomever you choose. You are unwilling to give in to your partner, because you always want things your own way. This could be a problem in your friendships. However, now is the time when you can learn how to give and how to make compromises with friends, relatives and other people. People usually like you because you are yourself, not because you are charming. You know what you want, and you are willing to go after it. Venus in the Eighth House You enjoy your senses, and you want to experience the world as vividly and totally as possible. You seem to be looking for a hidden dimension of the world that will transform your life completely. Often you will seek this dimension through relationships with others, which will be very intense and full of feeling. Be careful not to be too possessive of your friends. Also, you shouldn't choose your friends according to the advantages you will gain from their friendship. While you are young, you should begin to take care of your health by not eating or drinking too much and by getting plenty of physical exercise. Mars in Aquarius Rather than working according to established patterns, you want to find your own way, which you hope will be better. As a result you are quite inventive and original As you get older you will be concerned with the greater good of society. You are quite capable of directing your efforts to goals that will not benefit you personally but will benefit others. Even while you are young, you resent authority. If you are convinced of the importance of a cause, you work better with a group than you do alone. Mars in the Sixth House You enjoy hard work, as long as you can control the way you do it. You are quite disciplined in your own work habits, but you don't like to work with people who are less disciplined. But if you respect those who have authority over you, if they have demonstrated that they do know more than you and can teach you something, you will be an excellent employee. However, when you are older, your work drive will be expressed most smoothly if you are self-employed. When working with others, especially if you are the leader, try not to be too critical. With this placement, it is very important that you learn to express your honest feelings of anger.","tags":"Joce","url":"http://mattie.id.au/posts/2007-05-joce-horroscope.html"}]}